Revit 2027 API
GroupTypeId.RailingSystemSegmentPosts Property
 Posts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemSegmentPosts { get; }
Public Shared ReadOnly Property RailingSystemSegmentPosts As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemSegmentPosts {
	ForgeTypeId^ get ();
}
static member RailingSystemSegmentPosts : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace